phonecalls.org
#+title: Phone Log
#+setupfile: https://0xbadc0fee.github.io/org-html-themes/org/theme-readtheorg.setup
#+TODO: TODO(t) WAIT(w@/!) Q&A(q) | DONE(d!) CANCELED(c@)
#+options: ^:nil

* 2024
** 2024-01 January
*** 2024-01-08 Monday
**** Jason Groeninger
***** Check-in and Response to emailed Q&A
- Quick Teams review with JG about my tasks.
- SC: I was concerned about NOV project not looking like much traction.
  - JG: that was fine, ball in customers court, not to worry
- SC: suggested some additional jira tasks.  Still need more familiarity with tools and products.
  talked about pwm control work I had done using the 4CT.  Shared confusion over I/O configuration
  practices and approaches.
  - JG: understood.
- SC: had sent a list of I/O configurations questions prior Friday for JG to review
  - JG: answered the I/O questions, discussion turned to some unanswered I/O questions.
    Suggested making a new Jira task for exploring I/O configuration workflow comparison
    between HALC methods and BIOS methods.
- SC: agreed.  Call
****** DONE Next Action
CLOSED: [2024-01-12 Fri 07:17]
- [X] Make new Jira task for gen 3 (HALC enabled) to test HALC and BIOS methods of I/O config.
Call Details [2024-01-08 Mon 10:09]
*** 2024-01-11 Thursday
**** Andres Rojas
***** NOV inquiry
- AR: Contacted SC and asked for update on NOV project ENGPO-783
  - SC responed that nothing new has happened, waiting on customer.
    shared that customer estimated it would be into January before they knew more
- AR asked for further update / review and to be updated next day
  - SC agreed, contacted LW via teams same day to review project.
- SC added new subject of willingness to stay in ATL for longer stays
  in order to either deepen team building, work on a co-op STW project, or
  be available for something similar.  Suggested doubling or tripling up in
  shared lodging (VRBO / Air bnb) with other E team members, ie KB & ZD.
****** DONE Next Action(s)
CLOSED: [2024-01-12 Fri 07:47]
- [X] Contact Luke & review project
- [X] respond to AR by mid day Friday.
*** 2024-01-12 Friday
**** Luke Weninger
***** Checking on NOV Project
- asked about next steps
  - responded that we're waiting for NOV to gauge interest from their customer.
- agreed, asked Luke's opinion on how much time we should wait till we ping them.
  also confirmed who NOV contact is that would have that input, sounds like Eric Conn.
  - L responded that he had pinged Eric before the break, and that would ping him again today.
Call Details [2024-01-12 Fri 06:57]
**** Andres Rojas / TEAMS
***** Continuation of Thur convo
- SC returning call from Thursday, updating AR on NOV project.
Call Details [2024-01-12 Fri 07:49]
*** 2024-01-17 Wednesday
**** Jason Groeninger, Zac Dawson, Chuck McPherson, Andrew Luthen, Mike Carney, SC
***** Quality Hydraulics QnA IOXP -> 4CT conversions
- JG reviewed purposed of call, handed over to AL to describe needs
- AL looking for guidance, correct tool chain, for converting existing IOXP IEC code to LogiCAD
- JG reviewed basic process, tools, logicad version, pro's con's of C v. IEC, and basic expectations of process.
- CM suggested MC place order for an initial 4CT to have as a go-by, MC agreed.
