phonecalls.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-13 Mon 13:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Phone Log</title>
<meta name="author" content="scurfman" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://0xbadc0fee.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://0xbadc0fee.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Phone Log</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2682fbe">1. 2024</a>
<ul>
<li><a href="#org9470235">1.1. 2024-01 January</a>
<ul>
<li><a href="#orgf90a569">1.1.1. 2024-01-08 Monday</a></li>
<li><a href="#org22b1d87">1.1.2. 2024-01-11 Thursday</a></li>
<li><a href="#org7011d75">1.1.3. 2024-01-12 Friday</a></li>
<li><a href="#org1e25bfa">1.1.4. 2024-01-17 Wednesday</a></li>
<li><a href="#orga3a7b2a">1.1.5. 2024-01-19 Friday</a></li>
<li><a href="#org1aa5499">1.1.6. 2024-01-22 Monday</a></li>
</ul>
</li>
<li><a href="#orga2207f2">1.2. 2024-04 April</a>
<ul>
<li><a href="#orga12c205">1.2.1. 2024-04-30 Tuesday</a></li>
</ul>
</li>
<li><a href="#org0ebf8c5">1.3. 2024-05 May</a>
<ul>
<li><a href="#org70773b1">1.3.1. 2024-05-13 Monday</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2682fbe" class="outline-2">
<h2 id="org2682fbe"><span class="section-number-2">1.</span> 2024</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9470235" class="outline-3">
<h3 id="org9470235"><span class="section-number-3">1.1.</span> 2024-01 January</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf90a569" class="outline-4">
<h4 id="orgf90a569"><span class="section-number-4">1.1.1.</span> 2024-01-08 Monday</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgc83697f"></a>Jason Groeninger<br />
<ol class="org-ol">
<li><a id="orgfb7d30c"></a>Check-in and Response to emailed Q&amp;A<br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<ul class="org-ul">
<li>Quick Teams review with JG about my tasks.</li>
<li>SC: I was concerned about NOV project not looking like much traction.
<ul class="org-ul">
<li>JG: that was fine, ball in customers court, not to worry</li>
</ul></li>
<li>SC: suggested some additional jira tasks.  Still need more familiarity with tools and products.
talked about pwm control work I had done using the 4CT.  Shared confusion over I/O configuration
practices and approaches.
<ul class="org-ul">
<li>JG: understood.</li>
</ul></li>
<li>SC: had sent a list of I/O configurations questions prior Friday for JG to review
<ul class="org-ul">
<li>JG: answered the I/O questions, discussion turned to some unanswered I/O questions.
Suggested making a new Jira task for exploring I/O configuration workflow comparison
between HALC methods and BIOS methods.</li>
</ul></li>
<li>SC: agreed.  Call</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org0027555"></a><span class="done DONE">DONE</span> Next Action<br />
<div class="outline-text-7" id="text-1-1-1-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Make new Jira task for gen 3 (HALC enabled) to test HALC and BIOS methods of I/O config.</li>
</ul>
<p>
Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-08 Mon 10:09]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org22b1d87" class="outline-4">
<h4 id="org22b1d87"><span class="section-number-4">1.1.2.</span> 2024-01-11 Thursday</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="orgf9e12ef"></a>Andres Rojas<br />
<ol class="org-ol">
<li><a id="orgc24c0b6"></a>NOV inquiry<br />
<div class="outline-text-6" id="text-1-1-2-1-1">
<ul class="org-ul">
<li>AR: Contacted SC and asked for update on NOV project ENGPO-783
<ul class="org-ul">
<li>SC responed that nothing new has happened, waiting on customer.
shared that customer estimated it would be into January before they knew more</li>
</ul></li>
<li>AR asked for further update / review and to be updated next day
<ul class="org-ul">
<li>SC agreed, contacted LW via teams same day to review project.</li>
</ul></li>
<li>SC added new subject of willingness to stay in ATL for longer stays
in order to either deepen team building, work on a co-op STW project, or
be available for something similar.  Suggested doubling or tripling up in
shared lodging (VRBO / Air bnb) with other E team members, ie KB &amp; ZD.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org8d08515"></a><span class="done DONE">DONE</span> Next Action(s)<br />
<div class="outline-text-7" id="text-1-1-2-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Contact Luke &amp; review project</li>
<li class="on"><code>[X]</code> respond to AR by mid day Friday.</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org7011d75" class="outline-4">
<h4 id="org7011d75"><span class="section-number-4">1.1.3.</span> 2024-01-12 Friday</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="orgbcc7251"></a>Luke Weninger<br />
<ol class="org-ol">
<li><a id="org898fc70"></a>Checking on NOV Project<br />
<div class="outline-text-6" id="text-1-1-3-1-1">
<ul class="org-ul">
<li>asked about next steps
<ul class="org-ul">
<li>responded that we're waiting for NOV to gauge interest from their customer.</li>
</ul></li>
<li>agreed, asked Luke's opinion on how much time we should wait till we ping them.
also confirmed who NOV contact is that would have that input, sounds like Eric Conn.
<ul class="org-ul">
<li>L responded that he had pinged Eric before the break, and that would ping him again today.</li>
</ul></li>
</ul>
<p>
Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-12 Fri 06:57]</span></span>
</p>
</div>
</li>
</ol>
</li>
<li><a id="orgc5e6d95"></a>Andres Rojas / TEAMS<br />
<ol class="org-ol">
<li><a id="orgb042973"></a>Continuation of Thur convo<br />
<div class="outline-text-6" id="text-1-1-3-2-1">
<ul class="org-ul">
<li>SC returning call from Thursday, updating AR on NOV project.</li>
</ul>
<p>
Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-12 Fri 07:49]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org1e25bfa" class="outline-4">
<h4 id="org1e25bfa"><span class="section-number-4">1.1.4.</span> 2024-01-17 Wednesday</h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<ol class="org-ol">
<li><a id="orga613df5"></a>Jason Groeninger, Zac Dawson, Chuck McPherson, Andrew Luthen, Mike Carney, SC<br />
<ol class="org-ol">
<li><a id="orgb314faa"></a>Quality Hydraulics QnA IOXP -&gt; 4CT conversions<br />
<div class="outline-text-6" id="text-1-1-4-1-1">
<ul class="org-ul">
<li>JG reviewed purposed of call, handed over to AL to describe needs</li>
<li>AL looking for guidance, correct tool chain, for converting existing IOXP IEC code to LogiCAD</li>
<li>JG reviewed basic process, tools, logicad version, pro's con's of C v. IEC, and basic expectations of process.</li>
<li>CM suggested MC place order for an initial 4CT to have as a go-by, MC agreed.</li>
</ul>
</div>
<ol class="org-ol">
