phonecalls.md

# Table of Contents

1.  [2024](#org2795c73)
    1.  [2024-01 January](#orgad49f49)
        1.  [2024-01-08 Monday](#org3ee7b2a)
        2.  [2024-01-11 Thursday](#orgfe2326e)
        3.  [2024-01-12 Friday](#orgc6220b0)
        4.  [2024-01-17 Wednesday](#orgc82c6fd)
        5.  [2024-01-19 Friday](#org244ef37)
        6.  [2024-01-22 Monday](#org372aa8f)
    2.  [2024-04 April](#orgda85775)
        1.  [2024-04-30 Tuesday](#org1812d88)
    3.  [2024-05 May](#org25056b2)
        1.  [2024-05-13 Monday](#org9f62632)



<a id="org2795c73"></a>

# 2024


<a id="orgad49f49"></a>

## 2024-01 January


<a id="org3ee7b2a"></a>

### 2024-01-08 Monday

1.  Jason Groeninger

    1.  Check-in and Response to emailed Q&A
    
        -   Quick Teams review with JG about my tasks.
        -   SC: I was concerned about NOV project not looking like much traction.
            -   JG: that was fine, ball in customers court, not to worry
        -   SC: suggested some additional jira tasks.  Still need more familiarity with tools and products.
            talked about pwm control work I had done using the 4CT.  Shared confusion over I/O configuration
            practices and approaches.
            -   JG: understood.
        -   SC: had sent a list of I/O configurations questions prior Friday for JG to review
            -   JG: answered the I/O questions, discussion turned to some unanswered I/O questions.
                Suggested making a new Jira task for exploring I/O configuration workflow comparison
                between HALC methods and BIOS methods.
        -   SC: agreed.  Call
        
        1.  DONE Next Action
        
            -   [X] Make new Jira task for gen 3 (HALC enabled) to test HALC and BIOS methods of I/O config.
            
            Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-08 Mon 10:09]</span></span>


<a id="orgfe2326e"></a>

### 2024-01-11 Thursday

1.  Andres Rojas

    1.  NOV inquiry
    
        -   AR: Contacted SC and asked for update on NOV project ENGPO-783
            -   SC responed that nothing new has happened, waiting on customer.
                shared that customer estimated it would be into January before they knew more
        -   AR asked for further update / review and to be updated next day
            -   SC agreed, contacted LW via teams same day to review project.
        -   SC added new subject of willingness to stay in ATL for longer stays
            in order to either deepen team building, work on a co-op STW project, or
            be available for something similar.  Suggested doubling or tripling up in
            shared lodging (VRBO / Air bnb) with other E team members, ie KB & ZD.
        
        1.  DONE Next Action(s)
        
            -   [X] Contact Luke & review project
            -   [X] respond to AR by mid day Friday.


<a id="orgc6220b0"></a>

### 2024-01-12 Friday

1.  Luke Weninger

    1.  Checking on NOV Project
    
        -   asked about next steps
            -   responded that we're waiting for NOV to gauge interest from their customer.
        -   agreed, asked Luke's opinion on how much time we should wait till we ping them.
            also confirmed who NOV contact is that would have that input, sounds like Eric Conn.
            -   L responded that he had pinged Eric before the break, and that would ping him again today.
        
        Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-12 Fri 06:57]</span></span>

2.  Andres Rojas / TEAMS

    1.  Continuation of Thur convo
    
        -   SC returning call from Thursday, updating AR on NOV project.
        
        Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-12 Fri 07:49]</span></span>


<a id="orgc82c6fd"></a>

### 2024-01-17 Wednesday

1.  Jason Groeninger, Zac Dawson, Chuck McPherson, Andrew Luthen, Mike Carney, SC

    1.  Quality Hydraulics QnA IOXP -> 4CT conversions
    
        -   JG reviewed purposed of call, handed over to AL to describe needs
        -   AL looking for guidance, correct tool chain, for converting existing IOXP IEC code to LogiCAD
        -   JG reviewed basic process, tools, logicad version, pro's con's of C v. IEC, and basic expectations of process.
        -   CM suggested MC place order for an initial 4CT to have as a go-by, MC agreed.
        
        1.  DONE Next action(s) <code>[2/2]</code>
