phonecalls.org
****** DONE Next action(s) [2/2]
CLOSED: [2024-01-19 Fri 12:36]
- [X] JG will get AL correct TSP and confirm logicad installation version required.
- [X] MC will order an initial, suitable variant, 4CT to work with.
Call Details [2024-01-17 Wed 07:29]
**** Andres Rojas, Jason Goeninger, SGC, Tiffany Ghonert
***** J1939 Plugin in Review 2
- AR gave quick summary intro, handed over to TG
- TG explained the existing roadmap and where we are currently on it
- AR illustrated ways SC can be utilized in the project
- JG said we'll back log the two existing Jira tasks of SC and prioritize the J1939 one
- TG illustrated anticipated tasks for SC and laid out next steps: Onboarding
****** DONE Next Actions [5/5]
CLOSED: [2024-01-19 Fri 12:36]
- [X] Download QT
- [X] Install correct compiler
- [X] Download and install OpenSource QT tool
- [X] Clone the github repo for J1939 project
- [X] Report back to TG when QT is intalled.
Call Details [2024-01-17 Wed 14:04]
*** 2024-01-19 Friday
**** Silas Curfman, Jason Groeninger, Luke Weninger
***** Plan next steps re: NOV response
- JG reviewed NRE alternative approach; possibility of buying engineering time by the hr rather than an end-to-end project and capping out at customer limit of ~$12K.
- LW suggested keeping a project based bid approach, best preserves perceived value of engineering team time going forward.
- JG suggested bid for end-to-end project could be different if not required to preserve existing customer code and structure.  Without committing to a specific difference in value.  Advantage would be that it at least would give the customer an option to consider, giving them some agency in the next response. 
- LW proposed responding to NOV with STW staying firm on original SOW / quote as written; but also inquiring if NOV would like to explore the message conversion project without the constraint of preserving existing customer code. 
****** DONE Next Actions [1/1]
CLOSED: [2024-02-26 Mon 07:45]
- [X] Follow up with LW after next mondays call
Call Details [2024-01-19 Fri 12:31]
*** 2024-01-22 Monday
** 2024-04 April
*** 2024-04-30 Tuesday
**** Silas Curfman, Jason Sheehan
Call Details [2024-04-30 Tue 08:50]
***** ISOBUS experiences with Jason Sheehan, J&K Dairy S'side Wa
- SC what have JS's general experiences been with using ISOBUS as a dairy operator
  - JS using isobus on multiple tractors, multiple brands.  Primarily John Deere, but also Fendt
    - relatively new to isobus, previously more used to proprietery attachments
    - very happy so far with universality of isobos attachments.
    - very few painpoints if any.  quoted "I now spend more time tuning my screen menus than learning to operate the attachments" a good thing.
    - makes purchases much easier to compare, less leg work confirming compatability among devices
    - really likes customizable UI through adding menus / profiles to his "GPS"
    - "GPS" is means his main operator screen.  Operators are most used to the primary UI in the tractor being for GPS purposes, so they simply revert to calling the main ui "The GPS"
- SC any specifics about how he uses it?
  - Mixing and matching tractor to off brand attachments, multiple attachments, etc
  - Earliest equipment that utilized isobus (that he owns) mostly just poached the +/- 12vdc power wires.
  - As time went on, attachment MFG's / OEM's started utilizing more and more of the bus for control of their devices.
  - Biggest thing he does is to configure "profiles" for combinations of tractor / attachment based on how he's going to use the system
    - e.g. "Cutting - Hay" , "Spraying", "Planting - xRows", etc.
    - his goal is to get the most utility out of any one piece of equipemnt, so universal control and connection is fundamental to that.
- JS asked about STW, what we make, what we do
  - Gave brief background on STW, products, and services.
  - JS was interested / encouraged by STW focus on "freely programmable" / "open source" approach
  - JS asked if STW ever takes on interns, has a son in college for BSME.
