phonecalls.html
<li><a id="orgb2319ec"></a><span class="done DONE">DONE</span> Next action(s) <code>[2/2]</code><br />
<div class="outline-text-7" id="text-1-1-4-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> JG will get AL correct TSP and confirm logicad installation version required.</li>
<li class="on"><code>[X]</code> MC will order an initial, suitable variant, 4CT to work with.</li>
</ul>
<p>
Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-17 Wed 07:29]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org7d86280"></a>Andres Rojas, Jason Goeninger, SGC, Tiffany Ghonert<br />
<ol class="org-ol">
<li><a id="orge9437dd"></a>J1939 Plugin in Review 2<br />
<div class="outline-text-6" id="text-1-1-4-2-1">
<ul class="org-ul">
<li>AR gave quick summary intro, handed over to TG</li>
<li>TG explained the existing roadmap and where we are currently on it</li>
<li>AR illustrated ways SC can be utilized in the project</li>
<li>JG said we'll back log the two existing Jira tasks of SC and prioritize the J1939 one</li>
<li>TG illustrated anticipated tasks for SC and laid out next steps: Onboarding</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org1b6cd00"></a><span class="done DONE">DONE</span> Next Actions <code>[5/5]</code><br />
<div class="outline-text-7" id="text-1-1-4-2-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Download QT</li>
<li class="on"><code>[X]</code> Install correct compiler</li>
<li class="on"><code>[X]</code> Download and install OpenSource QT tool</li>
<li class="on"><code>[X]</code> Clone the github repo for J1939 project</li>
<li class="on"><code>[X]</code> Report back to TG when QT is intalled.</li>
</ul>
<p>
Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-17 Wed 14:04]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orga3a7b2a" class="outline-4">
<h4 id="orga3a7b2a"><span class="section-number-4">1.1.5.</span> 2024-01-19 Friday</h4>
<div class="outline-text-4" id="text-1-1-5">
</div>
<ol class="org-ol">
<li><a id="orgf0b2ac2"></a>Silas Curfman, Jason Groeninger, Luke Weninger<br />
<ol class="org-ol">
<li><a id="orgbb78afa"></a>Plan next steps re: NOV response<br />
<div class="outline-text-6" id="text-1-1-5-1-1">
<ul class="org-ul">
<li>JG reviewed NRE alternative approach; possibility of buying engineering time by the hr rather than an end-to-end project and capping out at customer limit of ~$12K.</li>
<li>LW suggested keeping a project based bid approach, best preserves perceived value of engineering team time going forward.</li>
<li>JG suggested bid for end-to-end project could be different if not required to preserve existing customer code and structure.  Without committing to a specific difference in value.  Advantage would be that it at least would give the customer an option to consider, giving them some agency in the next response.</li>
<li>LW proposed responding to NOV with STW staying firm on original SOW / quote as written; but also inquiring if NOV would like to explore the message conversion project without the constraint of preserving existing customer code.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org5f8db03"></a><span class="done DONE">DONE</span> Next Actions <code>[1/1]</code><br />
<div class="outline-text-7" id="text-1-1-5-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Follow up with LW after next mondays call</li>
</ul>
<p>
Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-01-19 Fri 12:31]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org1aa5499" class="outline-4">
<h4 id="org1aa5499"><span class="section-number-4">1.1.6.</span> 2024-01-22 Monday</h4>
</div>
</div>
<div id="outline-container-orga2207f2" class="outline-3">
<h3 id="orga2207f2"><span class="section-number-3">1.2.</span> 2024-04 April</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orga12c205" class="outline-4">
<h4 id="orga12c205"><span class="section-number-4">1.2.1.</span> 2024-04-30 Tuesday</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="orgba50aee"></a>Silas Curfman, Jason Sheehan<br />
<div class="outline-text-5" id="text-1-2-1-1">
<p>
Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-04-30 Tue 08:50]</span></span>
</p>
</div>
<ol class="org-ol">
<li><a id="orgd15651a"></a>ISOBUS experiences with Jason Sheehan, J&amp;K Dairy S'side Wa<br />
<div class="outline-text-6" id="text-1-2-1-1-1">
<ul class="org-ul">
<li>SC what have JS's general experiences been with using ISOBUS as a dairy operator
<ul class="org-ul">
<li>JS using isobus on multiple tractors, multiple brands.  Primarily John Deere, but also Fendt
<ul class="org-ul">
<li>relatively new to isobus, previously more used to proprietery attachments</li>
<li>very happy so far with universality of isobos attachments.</li>
<li>very few painpoints if any.  quoted "I now spend more time tuning my screen menus than learning to operate the attachments" a good thing.</li>
<li>makes purchases much easier to compare, less leg work confirming compatability among devices</li>
<li>really likes customizable UI through adding menus / profiles to his "GPS"</li>
<li>"GPS" is means his main operator screen.  Operators are most used to the primary UI in the tractor being for GPS purposes, so they simply revert to calling the main ui "The GPS"</li>
</ul></li>
</ul></li>
<li>SC any specifics about how he uses it?
<ul class="org-ul">
<li>Mixing and matching tractor to off brand attachments, multiple attachments, etc</li>
<li>Earliest equipment that utilized isobus (that he owns) mostly just poached the +/- 12vdc power wires.</li>
<li>As time went on, attachment MFG's / OEM's started utilizing more and more of the bus for control of their devices.</li>
<li>Biggest thing he does is to configure "profiles" for combinations of tractor / attachment based on how he's going to use the system
<ul class="org-ul">
<li>e.g. "Cutting - Hay" , "Spraying", "Planting - xRows", etc.</li>
<li>his goal is to get the most utility out of any one piece of equipemnt, so universal control and connection is fundamental to that.</li>
</ul></li>
</ul></li>
<li>JS asked about STW, what we make, what we do
<ul class="org-ul">
<li>Gave brief background on STW, products, and services.</li>
<li>JS was interested / encouraged by STW focus on "freely programmable" / "open source" approach</li>
<li>JS asked if STW ever takes on interns, has a son in college for BSME.</li>
</ul></li>
</ul>
</div>
</li>
