phonecalls.org
***** TODO NEXT ACTIONS [0/3]
- [ ] JS invited SC to ride along next week either planting, cutting, or spraying to observe isobus VT usage.  Accepted, need to call back Friday.
- [ ] JS inquired about future internship / application for college son.  SC agreed to check if STW does internships.
- [ ] SC invited JS's son to see STW work from home lab.  Accepted.  Touch base on Friday.
** 2024-05 May
*** 2024-05-13 Monday
**** Tiffany Gohnert, Andres Rojas, Jason Groeninger, Joe Stephenson, Silas Curfman
***** J1939 Plugin Meeting
- Review of Plugin Status
- TG, gave current review
- AR, reogranized Jira to track multi Release
- TG, gave forecast going through 2024-06-18, Release 3.
  - discussed current testing feedback on R2
  - need more testers, either customers / R&D staff / Sales Team / all of above?
- AR reviewed resources for next sprint
- TG suggested work for SC if bandwidth available.
- SC asked about what stage a functional hardware model would be needed
***** TODO NEXT ACTIONS [/]
- [ ] SC to review new project load and reply to TG with availability 
Call Details [2024-05-13 Mon 13:06]
