phonecalls.html
<li><a id="org10d5786"></a><span class="todo TODO">TODO</span> NEXT ACTIONS <code>[0/3]</code><br />
<div class="outline-text-6" id="text-1-2-1-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> JS invited SC to ride along next week either planting, cutting, or spraying to observe isobus VT usage.  Accepted, need to call back Friday.</li>
<li class="off"><code>[&#xa0;]</code> JS inquired about future internship / application for college son.  SC agreed to check if STW does internships.</li>
<li class="off"><code>[&#xa0;]</code> SC invited JS's son to see STW work from home lab.  Accepted.  Touch base on Friday.</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org0ebf8c5" class="outline-3">
<h3 id="org0ebf8c5"><span class="section-number-3">1.3.</span> 2024-05 May</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org70773b1" class="outline-4">
<h4 id="org70773b1"><span class="section-number-4">1.3.1.</span> 2024-05-13 Monday</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="org988a87c"></a>Tiffany Gohnert, Andres Rojas, Jason Groeninger, Joe Stephenson, Silas Curfman<br />
<ol class="org-ol">
<li><a id="org6855ef0"></a>J1939 Plugin Meeting<br />
<div class="outline-text-6" id="text-1-3-1-1-1">
<ul class="org-ul">
<li>Review of Plugin Status</li>
<li>TG, gave current review</li>
<li>AR, reogranized Jira to track multi Release</li>
<li>TG, gave forecast going through 2024-06-18, Release 3.
<ul class="org-ul">
<li>discussed current testing feedback on R2</li>
<li>need more testers, either customers / R&amp;D staff / Sales Team / all of above?</li>
</ul></li>
<li>AR reviewed resources for next sprint</li>
<li>TG suggested work for SC if bandwidth available.</li>
<li>SC asked about what stage a functional hardware model would be needed</li>
</ul>
</div>
</li>
<li><a id="orga04a6fd"></a><span class="todo TODO">TODO</span> NEXT ACTIONS <code>[/]</code><br />
<div class="outline-text-6" id="text-1-3-1-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> SC to review new project load and reply to TG with availability</li>
</ul>
<p>
Call Details <span class="timestamp-wrapper"><span class="timestamp">[2024-05-13 Mon 13:06]</span></span>
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scurfman</p>
<p class="date">Created: 2024-05-13 Mon 13:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>